In [1]:
import pandas as pd 
import numpy as np

In [2]:
sozluk1={"isim":["ali","hakan","ayşe","kemal","ilayda"],"spor":["koşu","yüzme","voleybol","futbol","koşu"],"kalori":[100,200,300,400,100]
    }

In [3]:
dataFrame=pd.DataFrame(sozluk1,index=[0,1,2,3,4])

In [4]:
dataFrame

     isim      spor  kalori
0     ali      koşu     100
1   hakan     yüzme     200
2    ayşe  voleybol     300
3   kemal    futbol     400
4  ilayda      koşu     100

In [5]:
sozluk2={"isim":["ata","demir","asiye"],"spor":["yüzme","basketbol","voleybol"],"kalori":[200,500,300]
    }

In [6]:
dataFrame2=pd.DataFrame(sozluk2
                       ,index=[5,6,7])

In [7]:
dataFrame2

    isim       spor  kalori
5    ata      yüzme     200
6  demir  basketbol     500
7  asiye   voleybol     300

In [8]:
sozluk3={"isim":["faruk","mahmut",],"spor":["futbol","futbol",],"kalori":[400,400]
    }

In [9]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9])

In [10]:
dataFrame3

     isim    spor  kalori
8   faruk  futbol     400
9  mahmut  futbol     400

## concatanation

In [13]:
pd.concat([dataFrame,dataFrame2,dataFrame3],axis=0)

     isim       spor  kalori
0     ali       koşu     100
1   hakan      yüzme     200
2    ayşe   voleybol     300
3   kemal     futbol     400
4  ilayda       koşu     100
5     ata      yüzme     200
6   demir  basketbol     500
7   asiye   voleybol     300
8   faruk     futbol     400
9  mahmut     futbol     400

## merge

In [14]:
mergesozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
              "spor":["koşu","yğzme","koşu","basketbol"]   }

In [17]:
mergeDataframe=pd.DataFrame(mergesozluk1)

In [19]:
mergeDataframe

     isim       spor
0   ahmet       koşu
1  mehmet      yğzme
2  zeynep       koşu
3    atıl  basketbol

In [20]:
mergesozluk2={"isim":["ahmet","mehmet","zeynep","atıl"],
              "kalori":[100,200,250,150]   }

In [21]:
mergeDataframe2=pd.DataFrame(mergesozluk2)

In [22]:
mergeDataframe2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     250
3    atıl     150

In [23]:
pd.merge(mergeDataframe,mergeDataframe2,on="isim")

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yğzme     200
2  zeynep       koşu     250
3    atıl  basketbol     150

In [25]:
maassozluk={"isim":["ayhan","demir","kaya","aysu"],
            "departman":["yazılım","finans","hukuk","yazılım"],   
              "maas":[4500,7500,6500,4500] 
           
           }

In [26]:
maasDataframe=pd.DataFrame(maassozluk)

In [27]:
maasDataframe

    isim departman  maas
0  ayhan   yazılım  4500
1  demir    finans  7500
2   kaya     hukuk  6500
3   aysu   yazılım  4500

In [30]:
maasDataframe["departman"].unique()

array(['yazılım', 'finans', 'hukuk'], dtype=object)

In [31]:
maasDataframe["departman"].nunique()

3

In [32]:
maasDataframe["departman"].value_counts()

yazılım    2
finans     1
hukuk      1
Name: departman, dtype: int64

In [36]:
def bruttennete(maas):
    return maas*0.66

In [37]:
maasDataframe["maas"].apply(bruttennete)

0    2970.0
1    4950.0
2    4290.0
3    2970.0
Name: maas, dtype: float64

In [38]:
maasDataframe.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [40]:
yenibirveri={"karakter sınıf":["southpark","southpark","simpson","simpson"],
            "karakter ismi":["cartmann","kyle","bart","marge"],
              "karakter yas":[9,10,20,50]  }

In [45]:
krtdf=pd.DataFrame(yenibirveri)

In [46]:
krtdf

  karakter sınıf karakter ismi  karakter yas
0      southpark      cartmann             9
1      southpark          kyle            10
2        simpson          bart            20
3        simpson         marge            50

In [48]:
krtdf.pivot_table(values="karakter yas",index=["karakter sınıf","karakter ismi"])

                              karakter yas
karakter sınıf karakter ismi
simpson        bart                     20
               marge                    50
southpark      cartmann                  9
               kyle                     10